In [1]:
import pandas as pd

In [16]:
user_input=[1,5,6,8,0,4,3,2]
user_input*2

[1, 5, 6, 8, 0, 4, 3, 2, 1, 5, 6, 8, 0, 4, 3, 2]

In [17]:
#kist has no shape it needs shape to make mathematical operation
user_2d_data=pd.DataFrame(user_input)
user_2d_data
# the data below is 2d data

   0
0  1
1  5
2  6
3  8
4  0
5  4
6  3
7  2

In [18]:
#converting nested list to panel data
user_input=[[1,2,3],[5,6,7],[13,23,43],[41,25,36]]
user_2d_data=pd.DataFrame(user_input)
user_2d_data

    0   1   2
0   1   2   3
1   5   6   7
2  13  23  43
3  41  25  36

In [19]:
# list with multiple datatypes
user_input=[[1,'d',3],[5,'dfdf',7],['df',23,True],[False,25,36]]
user_2d_data=pd.DataFrame(user_input)
user_2d_data

       0     1     2
0      1     d     3
1      5  dfdf     7
2     df    23  True
3  False    25    36

In [25]:
#data series
user_input=(1,5,6,8,0,4,3,2)
user_2d_data=pd.Series(user_input)
user_2d_data

0    1
1    5
2    6
3    8
4    0
5    4
6    3
7    2
dtype: int64

In [26]:
user_2d_data.sum()

29

In [27]:
#data frame
user_input=(1,5,6,8,0,4,3,2)
user_2d_data=pd.DataFrame(user_input)
user_2d_data

   0
0  1
1  5
2  6
3  8
4  0
5  4
6  3
7  2

In [23]:
#Coloumn wise sum
user_input=[[1,2,3],[5,6,7],[13,23,43],[41,25,36]]
user_2d_data=pd.DataFrame(user_input)
user_2d_data.sum()

0    60
1    56
2    89
dtype: int64

In [35]:
#row wise sum
user_input=[[1,2,3],[5,6,7],[13,23,43],[41,25,36]]
user_2d_data=pd.DataFrame(user_input)
user_2d_data.sum(axis=1)

0      6
1     18
2     79
3    102
dtype: int64

In [33]:
"""
pandas.DataFrame( data, index, columns, dtype, copy)
	
data

data takes various forms like ndarray, series, map, lists, dict, constants and also another DataFrame.
---->
index

For the row labels, the Index to be used for the resulting frame is Optional Default np.arange(n) if no index is passed

------>
	
columns

For column labels, the optional default syntax is - np.arange(n). This is only true if no index is passed.
--->
dtype

Data type of each column.
-->
copy

This command (or whatever it is) is used for copying of data, if the default is False.

"""

'\npandas.DataFrame( data, index, columns, dtype, copy)\n\t\ndata\n\ndata takes various forms like ndarray, series, map, lists, dict, constants and also another DataFrame.\n---->\nindex\n\nFor the row labels, the Index to be used for the resulting frame is Optional Default np.arange(n) if no index is passed\n\n------>\n\t\ncolumns\n\nFor column labels, the optional default syntax is - np.arange(n). This is only true if no index is passed.\n--->\ndtype\n\nData type of each column.\n-->\ncopy\n\nThis command (or whatever it is) is used for copying of data, if the default is False.\n\n'

In [38]:
#indexing row wise nameing
user_input=[[1,2,3],[5,6,7],[13,23,43],[41,25,36]]
user_2d_data=pd.DataFrame(user_input,index=['r1','r2','r3','r4'])
user_2d_data

     0   1   2
r1   1   2   3
r2   5   6   7
r3  13  23  43
r4  41  25  36

In [41]:
#indexing column wise nameing
user_input=[[1,2,3],[5,6,7],[13,23,43],[41,25,36]]
user_2d_data=pd.DataFrame(user_input,columns=['c1','c2','c3'])
user_2d_data

   c1  c2  c3
0   1   2   3
1   5   6   7
2  13  23  43
3  41  25  36

In [46]:
#indexing row,column wise nameing
user_input=[[1,2,3],[5,6,7],[13,23,43],[41,25,36]]
user_2d_data=pd.DataFrame(user_input,index=['r1','r2','r3','r4'],columns=['c1','c2','c3'],dtype=float)
user_2d_data

      c1    c2    c3
r1   1.0   2.0   3.0
r2   5.0   6.0   7.0
r3  13.0  23.0  43.0
r4  41.0  25.0  36.0

In [51]:
#columns selection
user_2d_data['c1']

r1     1.0
r2     5.0
r3    13.0
r4    41.0
Name: c1, dtype: float64

In [54]:
my_input={'name':['subhash','deena'],'team':['CSK','DC']}
my_data_2d=pd.DataFrame(my_input)
my_data_2d

      name team
0  subhash  CSK
1    deena   DC

In [58]:
my_input={'name':['subhash','deena'],'team':['CSK','DC']}
my_data_2d=pd.DataFrame(my_input,index=['a','b'])
my_data_2d

      name team
a  subhash  CSK
b    deena   DC

In [75]:
"""
loc is label-based, which means 
that you have to specify rows and columns based on their row and column labels.
iloc is integer position-based, 
so you have to specify rows and columns by their integer position values (0-based integer position).

loc[row_label, column_label]
iloc[row_position, column_position]

"""

'\nloc is label-based, which means \nthat you have to specify rows and columns based on their row and column labels.\niloc is integer position-based, \nso you have to specify rows and columns by their integer position values (0-based integer position).\n\nloc[row_label, column_label]\niloc[row_position, column_position]\n\n'

In [61]:
my_input={'name':['subhash','deena'],'team':['CSK','DC']}
my_data_2d=pd.DataFrame(my_input,index=['a','b'])
my_data_2d

      name team
a  subhash  CSK
b    deena   DC

In [64]:
#for first row row name is 'a'
my_data_2d.loc['a']

name    subhash
team        CSK
Name: a, dtype: object

In [66]:
#index based acces of location of first row
my_data_2d.iloc[0]

name    subhash
team        CSK
Name: a, dtype: object

In [67]:
#index based acces of location of first row,first coloumn
my_data_2d.iloc[0,0]

'subhash'

In [68]:
#index based acces of location of first row,all columns
my_data_2d.iloc[0,0:]

name    subhash
team        CSK
Name: a, dtype: object

In [69]:
# all rows first coloumn
my_data_2d.iloc[0:,1]

a    CSK
b     DC
Name: team, dtype: object

In [77]:
my_data_2d['name'][0]

'subhash'

In [83]:
df=pd.read_csv("train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [84]:
df[["Age",'Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [85]:
df[["Age", "Fare"]].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [96]:
#group by on basis of SEX of the coln Age and making the mean
# mean age based on SEX
"""
DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, 
group_keys=True, squeeze=NoDefault.no_default, observed=False, dropna=True)
"""
df[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  27.915709
male    30.726645

In [102]:
#group by on 
#mean of age and Fare on the basis of SEX
df[["Sex", "Age",'Fare']].groupby("Sex").mean()

              Age       Fare
Sex
female  27.915709  44.479818
male    30.726645  25.523893

In [119]:
df.groupby(['Sex'])[['Age','Fare']].mean()

              Age       Fare
Sex
female  27.915709  44.479818
male    30.726645  25.523893

In [92]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [109]:
data={"socre":[90,45,67,89],"out":[1,2,3,4],"player":['kolhi','dhoni','kolhi','sachin']}
df_data=pd.DataFrame(data)

In [122]:
df_data.groupby('player').mean()

        socre  out
player
dhoni    45.0  2.0
kolhi    78.5  2.0
sachin   89.0  4.0

In [106]:
df_data[['socre','player']].groupby("player").mean()

        socre
player
dhoni    45.0
kolhi    78.5
sachin   89.0

In [123]:
df_data.groupby(['player'])['socre'].count()

player
dhoni     1
kolhi     2
sachin    1
Name: socre, dtype: int64

In [126]:
df_data.groupby(['player'])['socre'].mean().sort_values()

player
dhoni     45.0
kolhi     78.5
sachin    89.0
Name: socre, dtype: float64

In [140]:
df.groupby(['Sex'])[['Age','Fare']].mean().sort_values(by='Age',ascending=False)

              Age       Fare
Sex
male    30.726645  25.523893
female  27.915709  44.479818

In [139]:
#dont apply sort after the group because the groupby object dosent ahve the method sort
df.sort_values(by='Age',ascending=False).groupby(['Sex'])[['Age','Fare']].mean()

              Age       Fare
Sex
female  27.915709  44.479818
male    30.726645  25.523893

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [142]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [144]:
import numpy as np
data={"socre":[90,45,67,np.nan],"out":[1,2,3,4],"player":['kolhi','dhoni','kolhi','sachin']}
df_data=pd.DataFrame(data)

In [146]:
df_data.groupby(['player']).mean()

        socre  out
player
dhoni    45.0  2.0
kolhi    78.5  2.0
sachin    NaN  4.0

In [147]:
df_data.groupby(['player'],dropna=False).mean()

        socre  out
player
dhoni    45.0  2.0
kolhi    78.5  2.0
sachin    NaN  4.0